Public Member Functions | List of all members
ACAPI::LicenseInfo::Impl::ProductVersionInfoImplBase Class Reference
API Infrastructure
Constructs an object of the ObjectImpl class. More...
#include <ProductVersionInfoImplBase.hpp>
 Inheritance diagram for ACAPI::LicenseInfo::Impl::ProductVersionInfoImplBase:
 Public Member Functions
ProductVersionInfoImplBase (const API_Token &token)
Constructs an object of the ProductVersionInfoImplBase class with the given token.
virtual GS::UniString  | GetProductFamilyId () const
Default implementation of the GetProductFamilyId.
virtual GS::UniString  | GetGSLanguageCode () const
Default implementation of the GetGSLanguageCode.
virtual GS::UniString  | GetVersionString () const
Default implementation of the GetVersionString.
virtual Int32  | GetVersionNum1 () const
Default implementation of the GetVersioNum1.
virtual Int32  | GetVersionNum2 () const
Default implementation of the GetVersioNum2.
virtual Int32  | GetVersionNum3 () const
Default implementation of the GetVersioNum3.
virtual Int32  | GetBuildNum () const
Default implementation of the GetBuildNum.
 Public Member Functions inherited from ACAPI::Impl::ObjectImpl
ObjectImpl (const API_Token &token)
Constructs an object of the ObjectImpl class.
const API_Token &  | GetToken () const
You can get the token that's used by the implementation.
 Additional Inherited Members
 Protected Attributes inherited from ACAPI::Impl::ObjectImpl
 const API_Token  | token
The token used by the implementation.
Detailed Description
Constructs an object of the ObjectImpl class.
Since
Archicad 28